void game_rule(){
  printf(" 1.主人公のステータスはゲームスタート時にランダムできまる\n");
  printf(" 2.移動時の操作は「W：上」「A：左」「S：下」「D：右」で操作する\n");
  printf(" 3.攻撃する順序は相手のSPDによる\n" );
  printf(" 4.ダメージは自身のATKー相手のDFF\n" );
  printf(" 5.スキルはMP1で1回使用可能\n");
  printf(" 6.洗脳は相手の残HPにより確率変動\n");
  printf(" 7.アイテムは戦闘終了後にランダムでドロップ\n");
  printf(" 8.宝箱は鍵を所持していないと空けられない\n");
  printf(" 9.アイテムは探索中でも使用可能\n" );
  printf("10.ある特定の武器はスキルを所持し、そのスキルを使用すると武器はなくなる\n" );
  printf("11.中ボスを倒すとラスボスに挑めるようになる\n" );
  printf("12.パーティが自分含め２人以上の場合、敵からの攻撃はランダムになる\n" );
  printf("13.宝箱からは武器が出る\n" );
  printf("----------------------------------------------------------------------\n");
}
