#include <stdio.h>


void main(){
	system("cls");
	for(;;){
		int s;
		//ここから
		printf("////////////////////////////////////////////
		ｫ´._ｾ＾.　　　　　　　　　　　　　　　,．　~'ｫ,,´　~..'e_!+,..る､.,rM拆ｔ4拆刃きｪ~も禾~たｶ_.　　　　　　　　　　　　　／.／／...ノ^.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　jf´,j拆ｧ　　　　　　　　　　　　　　　　＾Nﾇﾊ拆M_,こﾘゆ赱叱迩拆禾￣をMあM杙ﾛｫ┘~ｮ.　　　　　　　　　　　／.ン.／´／...　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　.l(/iM拆　　　　　　　　　　　　　　　　_　ｚ4汽拆あｙ禾迩拆拆拆｢.　　　｣拆)拆あ.拆拆^　气　　　　　　　　　／..／ｨ′ﾝ´　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　√.歹拆...　　　　　　　　　　　　　┌._ｫ├ｕ|叱迩拆拆|杙拆l拆|拆Ｌ,_　ア杙拆拆,きfl赱rヽ．~!...　　　　　　／､,ｒ'／　ﾝ′..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　ナ､''~迩v　j　　　　　　‐　　　´ｨ　t,,乞'ぬ迩迩拆l拆拆拆lあ亢拆拆叱￠拆拆&刃叱ｻ圷^´.　~L.　　　　／´ノ／　ｘ′　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　〕.　　~拆ｮオ.　　　　　　y'ｓ..j、拆5拆M坏e'き拆｢拆笊伝迩拆l拆拆拆Mｫ拆拆あ|拆!,　ヰ.λ.　.も.　　ノ　／ｒ′ノ^　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　.|　.．,j丁あﾄ.〈d　　_.,.Mｙｵあ.'あ拆拆拆伝;`!~´＼'fあ刈拆ｶ拆佗(拆兀｢拆ゆ万あ;卞/．　--ｬ　、ﾗ,／　r'ﾝ′／..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　..　　｜　´|...|.ｆM´拆e'..ﾜΜ迩拆あなき佗~迩ﾛ拆w＼ﾍ~5~气ｵM迩あM拆行ま拆すち拆;ぃt^Ｌ　　`Ｌ、｀ゝ.,i／　,r'.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　´l|!　　　　'や拆叱n拆拆あ拆．.圷ﾄ￣ｫ´あ~すあ,,｀'~＾.~そ万圷乍灯拆迩拆fM叱`~拆｢コ`;,,_.　＼气_´~.　／.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　〕′　　　　ｭ拆杙,)拆|拆拆叱)ゝ´乃q~+｀あ　气iまΜ乞は〕/'.t迩拆_)拆气ｔﾀz勿W'叱あぬゝ　　`ｗｫ　Ｚ`.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　ﾘ　　´　　　.拆｝拆i赱あ|ｒ刋あ9_;,,w匕ＬｗｕＬ,_.、.き`~)+ｫ~拆拆(忙あ!~.u杙杙,.~拆ｕ,ﾖ拆ｶ(乃e.　　^´_　9..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　.ﾓ　　|..　　　f拆〔あ｢l拆杙,す拆|拆⌒　　　　　　￣~'　　.＾ﾒq´'拆あｔｧ气f佗拆lq_.「乍M9拆をﾈ,-''　　.`.ｰ~し　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　_ﾘ．　ヽ　　　.刈j|)拆亢拆拆p拆~'..　.u∈⌒~.ァｮィ　　　　　　~Nq,卞拆忙竹拆ｫｵ_Mﾛ..佗拆灯⊥^t.．.　+h~5,..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　...　　　ﾔ　　　　　　　　_~拆拆ｆ~.~.｀.　　　√..人_ujr′..　　　　　　　　Ⅹ~fe,,,~を&,~弋〕あ~.∨ｙｔ)拆迩ｫ|Αぃ、　　廴..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　'ｫ　　　　　.w拆'￣~'拆　　　　　　Г-､　　　　　　　　　　　　　　＼.　~　｀^ｰe,.´　'爪;ﾍ~Mｵあ.)(ｹ.s卜ｉ,,　　　)(　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　k　　　　　￣j'"|´dＫ`ｗ　　　　　　　　　　　　　　　　　　　　　　　.＼　　　‐u,_　　　.`.s.￣乍t`｀`'り`杙j'.　　^廴_,,､．　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　　.ｫ　　　　　　ｪ..`‐ﾇ‐｀└　　　　　　　　　　　　　　　　　　　　　　　　.＼.　　　｀~　_-　　　　　　　　´　ｶ,λ　　　あ.,.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　|．　　　　　ﾓ"′　　　　　　　　　　　　　　　　　　　　　　　　　　　　　`．　　　　.^'.､,　ｰ.,x‐冖.~　　　~　.'．　　'笊p,,...　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　叱　　　　　；.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　)､　　　　.　｀'　/..　　ﾉ　　　　　　　　　　M拆j､.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　　や　　　　ﾍ.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　｜　　　　　　　コ_,／　　!..ゝ‐..+ｬ　、｢．.汽|拆、.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　　´￠　´､_.　ﾍ_　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　｜　　　　　　　　　　　　　　　　　　　.~￢k`ｶ拆p､.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　　　　　＆_　　_　　ﾀ+．　　　　　.―　　　　　　　　　　　　　　　　　　　　　　ﾚ'ヽ..　　　　　　､　　　　　　．　　　　　　　　~￢拆ｮｕ.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　..　　　　　　　　.｛叱､ち．.　`、　　ﾏーｧ　　　　　　　　　　　　　　　　　　　　　　　　　　T.　　　　　　~ぃ；　　　　　　　　｀　　　　　　''..　´~`+s　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　　　　　　｀Τ_´气.._　＼　　　´　　　　　　　　　　　　　　　　　　　　　　　　　　　ﾍ　　　　　　　lq_　　　　　　　　．　　　　　　　　　　　＼　,.　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　　　　　　~lqィ赱9,,　＼　　xx_,、　,､ょ=―ｰ′　　　　　　　　　　　　　　　　　　＼　　　　　「｀ｴ　　　　　　　　´`ｒ　　　　,.　　└e,_　　_X,.．.　　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　　　　　,,．ニ．.　ｶＬ,'禾!′　＼ﾍ.．y冖~　　　　　　　　　　　　　　　,ィ~　　　　　　　　　't　　　　　`.´．　　　　‐,　　　　`　　　　　　　　~fe、~ﾍｔ.′　　　　　　　　　　　　　　　　　　　　　　　　
	　.　　　　_〆￣　　⌒'⌒禾´　　　　　.＼,'＼,...,_v　　　　　　　　　　　　,ｘ／　　　　　　　　　　　┐　　　　　'.＼　　　ヽ..e.,`　　　　　　　　　　　　｀　　｀＋　　　　　　　　　　　　　　　　　　　　　　　　
	　　　　ノ′　　　　　　　丿.　′.　　　　　＼＾.　　　　　　　　　　　　,／ｨ´　　　　　　　　,,.．-:冖⌒　　　　　　^　~+　　　_癶　　　　　　､_　　　MＫ,_~.".+.~+.　　　　　　　　　　　　　　　　　　　　　　　
	　　　./.　　　　　　　　　m＼　ヽ_　、　　　　＼　　　　　　　　　,x‐'^../.　　　　　　,．;''^　_　　　　　　　　　　　　　　　　　　~_､　　　　　　　　　　`もそj、　＾｛...　　　　　　　　　　　　　　　　　　　　　　
	　.　､′.　　　　　　　　б_　´＼：.'　　　　　　　`'-､.＿,､．ｰ.''"..　　/　　　　　,.．´＼,..二Ｌ_　　　　　　　　　　　　　　　　　｀)v　　　／∫.　　　　　~ｫⅤ'9、.∫　　　　　　　　　　　　　　　　　　　　　　
	　_,ｒ..　　,,+､　　　　　　И、　　　气't┌.　　　　　　　　　　　　　　/　　　　／'ρ.　　　　　　＾'‐､　,ノﾍ　　　　　　　　　　　　　そ　ｫ　　.|.　　　　　　そ〔　.~ｓｽ　　　　　　　　　　　　　　　　　　　　　　
	　〕　　〃　)w　　　　／　`　`┐　´　~.　　　　　　　　　　　Ｔ￣｀ﾔ　　　／._‐.,(.　　　　　　　　　.~.　　|..　　　．　　　　　　　　　.'　_t.　丿　　　　　．．を　　~气.　　　　　　　　　　　　　　　　　　　　　
	　ｲ　/′　　｀＼　､:　　　　　　.Ｔ,　r　　　　　　　　　,､、　｜　　´　　ノ.,　｀｀~.~〉　　　　　　　　　.ｭ　+――-=､、　　　　　　　　　　　　　　　　_.ｮ,..　　ま　　　　　　　　　　　　　　　　　　　　　　　　　
	　-ﾆヽ..,　　　　`ｆ　　　　　　　　　~ﾔ.　　　　　　　　｛‐.､＼_l　　　　ノ　′~.~　）.　　　　　　　　.w+ｆ七二こ二辷＜ｘ、　　　　　　　　　　　　　.忙&ｨ._､_|｝...　　　　　　　　　　　　　　　　　　　　　　　　
	　┐_.`'ｰﾐ￢ヒ＾.　　　　　　　　　,ｒ′..　　　,ｫｮ!　　卜､`'ヘ.'|　　　/.　　　．Α.└e,、　　　　,ｗ=匕⌒‐￢冖冖.ｰ~ｺく＼　　　　　　　　　　　　j竹拆4uあ....　　　　　　　　　　　　　　　　　　　　　　　　
	　ほ伝ﾋぃ,｀''.＜,'-．.Ρノエ_ｘ,／　　　　.／./　　　｢．＞；,)!|　　/　_　　´　,._..,．''_ｘ〆~ょｻ＞'"　、　　　._　､,,.　　　.＼`､　　　　　　　,　　　jあま　拆!　　　　　　　　　　　　　　　　　　　　　　　　　　
	　_~ほ笊l乍　　　`丶ﾌ-'　,zす　　　　／..ノ＾　　　　　　ヽ杙．└ｓ　　　　ン~.pＦ~.pｵ~ｨ～´　,　',｝､ｰT~~；||l厂~`''‐+..,,..ﾍ`､.　　,ぃ.　.,　　.ｮj｢.`'卜　~｢..　　　　　　　　　　　　　　　　　　　　　　　　　　
	　.　ああ~　　　　　_．:スわ"　　　ヘ'′ｿ　　　　　　　　　　ﾉ.　　　`ｬ!'"~ヒ〔-ィ匕ィ'"　　　+ｲ匕ｓ　　f'._,刃!｢　　　　　.`ｰ＼ｗlああj｢.,,..jさ'　　´..　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　...　ま＾　　　_.．ﾆ..／rﾂ′.　　,ノ′у　　　.,xL．-vxMlM&　　　__ｬ杙叱ｔヨまヒｔ,__　　ｔr乍r‐'''^~￣.　　　　　　　　　　　ρ兀､'〈叱Μ~｢　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　´l|　　　　「．.冫y／　．.　,ﾈ"r`ｧ、t.　　丿　'!ejｨ√''^￣t,_　　　　　　´~~~冖￣~~ウ´　　　　　　　　　　　　　　　　　　　`もX刃｢.′..'.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　...　〕　　．.｣　　ﾚｼ^．　　,,〆.、;r′ゝヽ.　/　　　｀j_.　　　　~冖^'￣~~「宍'ｬw---ｯ‐-+　　　　　　　　　　　　　　　　　　　　　　Х、　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　　_/!　/.　う`ﾌｼ´　　　:杙汐〃　　　`^／　　　　　＞￢'-;ヤ┬　　　ｵＪ`~__.^"''|　　　　　　　　　　　　　　　　　　　　　　　　　Τ`．　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　:''´.「_/.｢メ／'′..　lwア汐′　　　　／..　　　　　ｘfちr弋~r.'′　　,　'ウ''＾　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　`Ⅹ､.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　f､｛../_ｒ'／'＾　　　,&(z灯"　　　　／　　　　　　ょf~＞i^‐."┘｀,..,＞'^　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　`!　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　ﾖ,..`ｹｧ,/　　''　,歹ｧｻr｀ｧ―‐　／　　　　　　.,ン''´　~ｨ.　ｭ+〆~.　　　　　　　　　　　　　　　　　_．.　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　
	　_＼､っ′　,.,xjｆ~　`ﾝ′．　　　　　　　　　／ヽ　｀　；」ィ''´.　　　　　　　　　　　　　　　　　　￣　`‐､．　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　\n");
		//ここまでタイトル画面
		printf(u8"１：ゲームルール表示\n");
		printf(u8"2：ゲームシナリオ表示\n");
		printf(u8"3：ゲームスタート\n");
		printf(u8"上記の中から数字を選択してください：");

		//if(s == 1){
			// system("clear");
			//windowsの場合は下記を使用
			//system("cls");
			//game_rule();//ルールを表示する関数
		//}else if(s == 2){
			// system("clear");
			//windowsの場合は下記を使用
			//system("cls");
			//break;
		//}
	}
}
